#11-14
import pymysql
conn = pymysql.connect(host='127.0.0.1', user='root', password='csr04758015!',db='chatDB',charset='utf8')
cur = conn.cursor()

sql_create_level1 = '''
    CREATE TABLE level1 (
        id INT UNSIGNED NOT NULL AUTO_INCREMENT,
        question VARCHAR(20) NOT NULL,
        PRIMARY KEY(id)
    )
'''
sql_create_level2 = '''
    CREATE TABLE level2 (
        id INT UNSIGNED NOT NULL AUTO_INCREMENT,
        question VARCHAR(20) NOT NULL,
        table1_id INT UNSIGNED NOT NULL,
        PRIMARY KEY(id)
    )
'''

sql_create_level3 = '''
    CREATE TABLE level3 (
        id INT UNSIGNED NOT NULL AUTO_INCREMENT,
        question VARCHAR(256) NOT NULL,
        table2_id INT UNSIGNED NOT NULL,
        PRIMARY KEY(id)
    )
'''

sql_create_level4 = '''
    CREATE TABLE level4 (
        id INT UNSIGNED NOT NULL AUTO_INCREMENT,
        question VARCHAR(256) NOT NULL,
        table3_id INT UNSIGNED NOT NULL,
        PRIMARY KEY(id)
    )
'''

level1_vals = [['학교'], ['시설']]
level2_vals = [['학과', 1], ['학사', 1], ['건물 위치', 2], ['오시는길', 2], ['주요시설', 2]]
level3_vals = [['학과 검색',1],['학과 선택',1], ['휴학',2],['전과',2],['재입학',2],['자퇴',2],['졸업',2],['건물위치 검색',3],['건물위치 선택',3],['경로',4],['시설 정보',5],\
['컴퓨터정보보안',1],['AI빅데이터',1],['글로벌호텔매니지먼트',1],['글로벌융합비즈니스',1],['경영학',1],['Endicott자유',1],['자기설계',1],['글로벌철도',1],['철도건설시스템',1],['철도경영',1],['물류시스템',1],['철도전기시스템',1],['철도소프트웨어',1],\
['철도차량시스템',1],['건축',1],['우송디젯철도아카데미',1],['IT보안',1],['글로벌미디어영상',1],['게임멀티미디어',1],['미디어디자인영상',1],['글로벌조리',1],['폴보퀴즈조리',1],['글로벌외식창업',1],['외식조리',1],['한식조리과학',1],['외식조리경영',1],\
['식품영양학',1],['바이오식품과학',1],['호텔관광경영',1],['사회복지학과',1],['작업치료학과',1],['언어치료전공',1],['청각학',1],['보건의료경영',1],['유아교육',1],['뷰티디자인경영',1],['응급구조',1],['소방방재',1],['안전공학',1],['간호학',1],['물리치료',1],['스포츠건강재활',1],\
['www.wsu.ac.kr/page/index.jsp?code=campus0103a',2],['www.wsu.ac.kr/page/index.jsp?code=campus0103c',2],['www.wsu.ac.kr/page/index.jsp?code=campus0103d',2],['www.wsu.ac.kr/page/index.jsp?code=campus0103e',2],['www.wsu.ac.kr/page/index.jsp?code=campus0102f',2],\
['우송도서관 위치:대전광역시 동구 동대전로 171(자양동 155-3번지)',3],['우송유치원 위치:대전광역시 동구 동대전로 171(자양동 155-3)우송유치원',3],['사회 봉사단 위치:대전광역시 동구 동대전로 171 학생회관 (W16)3층',3],['평생교육원 위치:대전광역시 동구 동대전로 171',3],['우송비즈니스 교육센터 위치:대전광역시 동구 자양동 17-2번지',3], ['우송대학교 서캠퍼스 우송관 (W7) 4층 414호',3] ,['비즈니스교육센터,우송IT교육센터 위치: 대전광역시 동구 백룡로 11번길 63 (자양동 52-2) 우송IT교육센터',3],\
['외국어교육원 위치: 대전광역시 동구 자양동 196-5번지',3],['우송디젤철도 아카데미 위치: 대전광역시 동구 동대전로 171(자양동226-2)',3] ,['서캠퍼스 철도물류관(W4)위치: B107-4호',3],['공자아카데미 위치: 대전광역시 동구 자양동 백룡로 5번길 66-1 우송어학센터 S1 공자아카데미 403호',3],['한국어교육원 위치: 대전광역시 동구 동대전로 171(자양동)',3], ['우송대학교 서캠퍼스 도서관위치: 704호 우송한국어교육원',3],['우송예술회관 위치: 서캠퍼스 W18 우송예술회관',3],['우송수련원 위치: 충청남도 보령시 신흑동 1944번지',3],\
['우송스포츠센터 위치: 서캠퍼스 보건의료과학관(W5)',3],['F스포렉스 위치: 대전광역시 동구 삼성1동 151-13',3],['솔브릿지국제대학 내 지하,대전화병원 위치: 대전광역시 동구 신안동 293-1(구 대전동중학교)',3],['AI빅데이터학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 엔디컷빌딩(W19)',3],['글로벌호텔매니지먼트학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 엔디컷빌딩(W19)',3],['글로벌융합비즈니스학과 위치: 대전광역시 동구 동대전로 171우송대 서캠퍼스 엔디컷빌딩(W19)',3],['경영학전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 우송관(W7)',3],\
['세무부동산학전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 우송관(W7)',3],['Endicott자유전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 엔디컷빌딩(W19)',3],['자기설계전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 엔디컷빌딩(W19)',3],['글로벌철도학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 엔디컷빌딩(W19)',3],['철도건설시스템전공 위치:대전광역시 동구 동대전로 171 우송대 서캠퍼스 철도물류관(W4)',3],['철도경영학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 보건의료과학관(W5)',3],\
['물류시스템학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 철도물류관(W4)',3],['철도전기시스템전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 철도물류관(W4)',3],['철도소프트웨어전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 철도물류관(W4)',3],['철도차량시스템학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 철도물류관(W4)',3],['건축공학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 국제교육센터(W2)',3],['우송디젯철도아카데미 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 철도물류관(W4)',3],\
['컴퓨터정보보안전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 식품건축관(구 사회관)(W15)',3],['IT보안전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 식품건축관(구 사회관)(W15)',3], ['글로벌미디어영상학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 엔디컷빌딩(W19)',3], ['게임멀티미디어전공 위치:대전광역시 동구 동대전로 171 우송대 서캠퍼스 미디어융합관(W17)',3], ['미디어디자인영상전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 미디어융합관(W17)',3],['글로벌조리전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 SICA',3], ['폴보퀴즈조리전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 SICA',3],\
['글로벌외식창업전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 엔디컷빌딩(W19)',3], ['외식조리전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 우송타워(W13)',3], ['한식조리과학전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 우송타워(W13)',3], ['외식조리경영전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 우송타워(W13)',3], ['식품영양학 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 우송타워(W13)',3], ['호텔관광경영학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 우송타워(W13)',3], ['사회복지학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 사회복지관(W10)',3],\
['작업치료학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 보건의료과학관(W5)',3], ['언어치료전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 보건의료과학관(W5)',3], ['보건의료경영학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 보건의료과학관(W5)',3], ['유아교육과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 정례원(W9)',3], ['뷰티디자인경영학과 위치: 대전광역시 동구 동대전로 143 우송뷰티센터(S3)',3], ['응급구조학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 보건의료과학관(W5)',3], ['소방방재전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 철도물류관(W4)',3],\
['간호학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 보건의료과학관(W5)',3], ['물리치료학과 위치: 대전광역시 동구 동대전로 171 서캠퍼스 보건의료과학관(W5)',3], ['스포츠건강재활학과 위치:대전광역시 동구 동대전로 171 우송대 서캠퍼스 보건의료과학관(W5)',3]]
level4_vals = [['교육 과정',1],['학과 설명',1], ['서류 및 과정',2],['해당 위치',3],['주요 시설명 검색 및 선택',5]]

with cur:
    cur.execute('DROP TABLE IF EXISTS level1')
    cur.execute('DROP TABLE IF EXISTS level2')
    cur.execute('DROP TABLE IF EXISTS level3')
    cur.execute('DROP TABLE IF EXISTS level4')
    cur.execute(sql_create_level1)
    cur.execute(sql_create_level2)
    cur.execute(sql_create_level3)
    cur.execute(sql_create_level4)
    cur.executemany("INSERT INTO level1(question) VALUES(%s)", level1_vals)
    cur.executemany("INSERT INTO level2(question, table1_id) VALUES(%s, %s)", level2_vals)
    cur.executemany("INSERT INTO level3(question, table2_id) VALUES(%s, %s)", level3_vals)
    cur.executemany("INSERT INTO level4(question, table3_id) VALUES(%s, %s)", level4_vals)
    

conn.commit()
conn.close()