import pymysql
conn = pymysql.connect(host='127.0.0.1', user='root', password='0000',db='chatDB',charset='utf8')
cur = conn.cursor()

sql_create_level1 = '''
    CREATE TABLE level1 (
        id INT UNSIGNED NOT NULL AUTO_INCREMENT,
        question VARCHAR(20) NOT NULL,
        PRIMARY KEY(id)
    )
'''
sql_create_level2 = '''
    CREATE TABLE level2 (
        id INT UNSIGNED NOT NULL AUTO_INCREMENT,
        question VARCHAR(20) NOT NULL,
        table1_id INT UNSIGNED NOT NULL,
        PRIMARY KEY(id)
    )
'''

sql_create_level3 = '''
    CREATE TABLE level3 (
        id INT UNSIGNED NOT NULL AUTO_INCREMENT,
        question VARCHAR(256) NOT NULL,
        table2_id INT UNSIGNED NOT NULL,
        PRIMARY KEY(id)
    )
'''

sql_create_level4 = '''
    CREATE TABLE level4 (
        id INT UNSIGNED NOT NULL AUTO_INCREMENT,
        question VARCHAR(256) NOT NULL,
        table3_id INT UNSIGNED NOT NULL,
        PRIMARY KEY(id)
    )
'''

level1_vals = [['학교'], ['시설']]
level2_vals = [['학과', 1], ['학사', 1], ['건물 위치', 2], ['오시는길', 2], ['주요시설', 2]]
# 22.11.14 조영수
level3_vals = [['휴학',2], ['전과',2], ['재입학',2], ['자퇴',2], ['졸업',2], ['건물위치 검색',3], ['건물위치 선택',3], ['경로',4], ['시설 정보',5],\
['컴퓨터정보보안',1], ['AI빅데이터',1], ['글로벌호텔매니지먼트',1], ['글로벌융합비즈니스',1], ['경영학',1], ['Endicott자유',1], ['자기설계',1], ['글로벌철도',1], ['철도건설시스템',1], ['철도경영',1], ['물류시스템',1], ['철도전기시스템',1], ['철도소프트웨어',1],\
['철도차량시스템',1], ['건축',1], ['우송디젯철도아카데미',1], ['IT보안',1], ['글로벌미디어영상',1], ['게임멀티미디어',1], ['미디어디자인영상',1], ['글로벌조리',1], ['폴보퀴즈조리',1], ['글로벌외식창업',1], ['외식조리',1], ['한식조리과학',1], ['외식조리경영',1],\
['식품영양학',1], ['바이오식품과학',1], ['호텔관광경영',1], ['사회복지학과',1], ['작업치료학과',1], ['언어치료전공',1], ['청각학',1], ['보건의료경영',1], ['유아교육',1], ['뷰티디자인경영',1], ['응급구조',1], ['소방방재',1], ['안전공학',1], ['간호학',1], ['물리치료',1], ['스포츠건강재활',1], ['세무부동산', 1],\
['www.wsu.ac.kr/page/index.jsp?code=campus0103a',2], ['www.wsu.ac.kr/page/index.jsp?code=campus0103c',2], ['www.wsu.ac.kr/page/index.jsp?code=campus0103d',2], ['www.wsu.ac.kr/page/index.jsp?code=campus0103e',2], ['www.wsu.ac.kr/page/index.jsp?code=campus0102f',2],\
['우송도서관 위치:대전광역시 동구 동대전로 171(자양동 155-3번지)',3], ['우송유치원 위치:대전광역시 동구 동대전로 171(자양동 155-3)우송유치원',3], ['사회 봉사단 위치:대전광역시 동구 동대전로 171 학생회관 (W16)3층',3], ['평생교육원 위치:대전광역시 동구 동대전로 171',3], ['우송비즈니스 교육센터 위치:대전광역시 동구 자양동 17-2번지',3], ['우송대학교 서캠퍼스 우송관 (W7) 4층 414호',3] ,['비즈니스교육센터,우송IT교육센터 위치: 대전광역시 동구 백룡로 11번길 63 (자양동 52-2) 우송IT교육센터',3],\
['외국어교육원 위치: 대전광역시 동구 자양동 196-5번지',3], ['우송디젤철도 아카데미 위치: 대전광역시 동구 동대전로 171(자양동226-2)',3], ['서캠퍼스 철도물류관(W4)위치: B107-4호',3], ['공자아카데미 위치: 대전광역시 동구 자양동 백룡로 5번길 66-1 우송어학센터 S1 공자아카데미 403호',3], ['한국어교육원 위치: 대전광역시 동구 동대전로 171(자양동)',3], ['우송대학교 서캠퍼스 도서관위치: 704호 우송한국어교육원',3],['우송예술회관 위치: 서캠퍼스 W18 우송예술회관',3],['우송수련원 위치: 충청남도 보령시 신흑동 1944번지',3],\
['우송스포츠센터 위치: 서캠퍼스 보건의료과학관(W5)',3], ['F스포렉스 위치: 대전광역시 동구 삼성1동 151-13',3], ['솔브릿지국제대학 내 지하,대전화병원 위치: 대전광역시 동구 신안동 293-1(구 대전동중학교)',3], ['AI빅데이터학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 엔디컷빌딩(W19)',3],['글로벌호텔매니지먼트학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 엔디컷빌딩(W19)',3],['글로벌융합비즈니스학과 위치: 대전광역시 동구 동대전로 171우송대 서캠퍼스 엔디컷빌딩(W19)',3],['경영학전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 우송관(W7)',3],\
['세무부동산학전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 우송관(W7)',3], ['Endicott자유전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 엔디컷빌딩(W19)',3], ['자기설계전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 엔디컷빌딩(W19)',3], ['글로벌철도학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 엔디컷빌딩(W19)',3],['철도건설시스템전공 위치:대전광역시 동구 동대전로 171 우송대 서캠퍼스 철도물류관(W4)',3],['철도경영학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 보건의료과학관(W5)',3],\
['물류시스템학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 철도물류관(W4)',3], ['철도전기시스템전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 철도물류관(W4)',3], ['철도소프트웨어전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 철도물류관(W4)',3], ['철도차량시스템학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 철도물류관(W4)',3],['건축공학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 국제교육센터(W2)',3],['우송디젯철도아카데미 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 철도물류관(W4)',3],\
['컴퓨터정보보안전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 식품건축관(구 사회관)(W15)',3], ['IT보안전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 식품건축관(구 사회관)(W15)',3], ['글로벌미디어영상학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 엔디컷빌딩(W19)',3], ['게임멀티미디어전공 위치:대전광역시 동구 동대전로 171 우송대 서캠퍼스 미디어융합관(W17)',3], ['미디어디자인영상전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 미디어융합관(W17)',3],['글로벌조리전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 SICA',3], ['폴보퀴즈조리전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 SICA',3],\
['글로벌외식창업전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 엔디컷빌딩(W19)',3], ['외식조리전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 우송타워(W13)',3], ['한식조리과학전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 우송타워(W13)',3], ['외식조리경영전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 우송타워(W13)',3], ['식품영양학 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 우송타워(W13)',3], ['호텔관광경영학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 우송타워(W13)',3], ['사회복지학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 사회복지관(W10)',3],\
['작업치료학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 보건의료과학관(W5)',3], ['언어치료전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 보건의료과학관(W5)',3], ['보건의료경영학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 보건의료과학관(W5)',3], ['유아교육과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 정례원(W9)',3], ['뷰티디자인경영학과 위치: 대전광역시 동구 동대전로 143 우송뷰티센터(S3)',3], ['응급구조학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 보건의료과학관(W5)',3], ['소방방재전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 철도물류관(W4)',3],\
['간호학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 보건의료과학관(W5)',3], ['물리치료학과 위치: 대전광역시 동구 동대전로 171 서캠퍼스 보건의료과학관(W5)',3], ['스포츠건강재활학과 위치:대전광역시 동구 동대전로 171 우송대 서캠퍼스 보건의료과학관(W5)',3]]
# 22.11.14 강민구
level4_vals = [['AI빅데이터학과 졸업 시 소프트웨어 개발자, 데이터베이스 관리자로 진로 결정 가능.', 11], ['글로벌호텔매니저먼트학과 졸업 시 호텔 총 지배인, 문화유산 해설사로 진로 결정 가능.', 12],\
['글로벌융합비즈니스학과 졸업 시 호텔 총 지배인, 문화유산 해설사로 진로 결정 가능.', 13], ['경영학 전공 졸업 시 호텔 총 지배인, 문화유산 해설사로 진로 결정 가능.', 14],\
['세무부동산학 전공 졸업 시 세무사, 부동산 신탁회사로 진로 결정 가능.', 52], ['Endicott자유 전공 입힉 시 원하는 학과로 진로 결정 가능.',15],\
['자기 설계 전공 입학 시 원하는 학과로 진로 결정 가능.', 16], ['글로벌철도학과 졸업 시 철도 공기업, 글로벌 철도 분야로 진로 결정 가능.', 17],\
['철도건설시스템전공 졸업 시 국영기업체, 산업체, 공무원으로 진로 결정 가능.', 18], ['철도경영학과 졸업 시 코레일, 한국 철도 시설 공단으로 진로 결정 가능.', 19],\
['물류시스템학과 졸업 시 철도 공사, 도시 철도 공사로  진로 결정 가능.', 20], ['철도전기시스템 전공 졸업 시 국영기업체, 철도 열차 운전 기관사 등 진로 결정 가능.', 21],\
['철도소프트웨어 전공 졸업 시 사설 철도 운양 기관, 철도 전기 분야 등 진로 결정 가능.', 22], ['철도차량시스템학과 졸업 시 각 도시의 경전철 운영기관, 공무원 및 공기업으로 진로 결정 가능.', 23],\
['건축공학과 졸업 시 건설회사, 건축감리전문회사, 건축자제전문회사 등 진로 결정 가능.', 24], ['우송디젯철도아카데미 졸업 시 철도 관련 회사로 진로 결정 가능.', 25],\
['컴퓨터정보보안 졸업 시 대기업, 우수 정보 보안 기업 등으로 진로 결정 가능.', 10], ['IT보안전공 졸업 시 LG CNS협력업체로 진로 결정 가능.', 26],\
['글로벌미디어영상학과 졸업 시 국내 외 미디어 제작 현장 한류 산업 현장 기자, 저널리스트 등 진로 결정 가능.', 27], ['게임멀티미디어전공 졸업 시 게임 및 멀티미디어 콘텐츠 업체 등 진로 결정 가능.', 28],\
['미디어디자인영상전공 졸업 시 브랜드 디자인 분야, BX(브랜드경형)디자이너 등 진로 결정 가능.', 29], ['글로벌조리전공 졸업 시 국내 외 호텔 유람선 및 리조트 전문 외식업체 등 진로 결정 가능.', 30],\
['폴보퀴즈조리전공 졸업 시 국내 외 호텔 유람선 및 리조트 전문 외식업체 진로 결정 가능.', 31], ['글로벌외식창업전공 졸업 시 특급호텔 및 리조트 전문외식 업체, 소믈리에 등 진로 결정 가능.', 32],\
['외식조리전공 졸업 시 호텔, 전문 식당 조리사, 체인형 식당 운영 가능 등 진로 결정 가능.', 33], ['한식조리과학전공 졸업 시 국내외 최고급 한식 레스토랑 조리사, 해외 공관 한식 전문 조리사 등 진로 결정 가능.', 34],\
['외식조리경영전공 졸업 시 국내 외 호텔 리조트 전문 외식 업체 외식 산업체 운영 진로 결정 가능.', 35], ['식품영양학전공 졸업 시 초,중,고 영양교사 등 진로 결정 가능.', 36],\
['바이오식품과학전공 졸업 시 식품 관련 산업체(식품가공개발 및 품질관리사) 진로 결정 가능.', 37], ['호텔관광경영학과 졸업 시 호텔관광 산업 분야 호텔, 여행사, 항공사 등으로 진로 결정 가능.', 38],\
['사회복지학과 졸업 시 정부 및 지방자치단체의 사회복지 공무원 등 진로 결정 가능.', 39], ['작업치료학과 졸업 시 의료기관, 재활의료관련 분야 등 진로 결정 가능.', 40],\
['언어치료전공 졸업 시 의료기관 진로 결정 가능.', 41], ['청각학전공 졸업 시 의료기관 진로 결정 가능.', 42], ['보건의료경영학과 졸업 시 의료기관 경영관리 분야,의료 업무, 원무, 인사 등 진로 결정 가능.', 43],\
['유아교육과 졸업 시 유치원교사, 보육교사 등 진로 결정 가능.', 44], ['뷰티디자인경영학과 졸업 시 메이크업 아티스트, 헤어디자이너, 스타일리스트 등 진로 결정 가능.', 45],\
['응급구조학과 졸업 시 자격증 취득 후 119구조구급대, 권역응급의료센텉 등 진로 결정 가능.', 46], ['소방방재전공 졸업 시 관련학과 학생만이 응시할 수 있는 8,9급 소방 공무원 특별채용시험 응시 가능.', 47],\
['안전공학전공 졸업 시 관련학과 학생만이 응시할 수 있는 8,9급 소방 공무원 특별채용시험 응시 가능.', 48], ['간호학과 졸업 시 국내 외 병원 간호사, 국제의료관광코디네이터로 진로 결정 가능.', 49],\
['물리치료학과 졸업 시 국내 종합 병원, 대학병원, 요양병원재활전문센터로 진로 결정 가능.', 50], ['스포츠건강재활학과 졸업 시 국내 외 프로구단, 선수촌,대학운동팀 트레이너로 진로 결정 가능.', 51],\
['AI빅데이터학과에서 취득가능한 자격증', 11], ['글로벌호텔매니지먼트학과에서 취득가능한 자격증', 12], ['글로벌융합비즈니스학과에서 취득가능한 자격증', 13], ['경영학전공에서 취득가능한 자격증', 14], ['세무부동산학전공에서 취득가능한 자격증', 52],\
['Endicott자유전공에서 취득가능한 자격증', 15], ['자기설계전공에서 취득가능한 자격증', 16], ['글로벌철도학과에서 취득가능한 자격증', 17], ['철도건설시스템전공에서 취득가능한 자격증', 18], ['철도경영학과에서 취득가능한 자격증', 19],\
['물류시스템학과에서 취득가능한 자격증', 20], ['철도전기시스템전공에서 취득가능한 자격증', 21], ['철도소프트웨어전공에서 취득가능한 자격증', 22], ['철도차량시스템학과에서 취득가능한 자격증', 23], ['건축공학과에서 취득가능한 자격증', 24],\
['우송디젯철도아카데미에서 취득가능한 자격증', 25], ['컴퓨터정보보안에서 취득가능한 자격증', 10], ['IT보안전공에서 취득가능한 자격증', 26], ['글로벌미디어영상학과에서 취득가능한 자격증', 27], ['게임멀티미디어전공에서 취득가능한 자격증', 28],\
['미디어디자인영상전공에서 취득가능한 자격증', 29], ['글로벌조리전공에서 취득가능한 자격증', 30], ['폴보퀴즈조리전공에서 취득가능한 자격증', 31], ['글로벌외식창업전공에서 취득가능한 자격증', 32], ['외식조리전공에서 취득가능한 자격증', 33],\
['한식조리과학전공에서 취득가능한 자격증', 34], ['외식조리경영전공에서 취득가능한 자격증', 35], ['식품영양학전공에서 취득가능한 자격증', 36], ['바이오식품과학전공에서 취득가능한 자격증', 37],['호텔관광경영학과에서 취득가능한 자격증', 38],\
['사회복지학과에서 취득가능한 자격증', 39], ['작업치료학과에서 취득가능한 자격증', 40], ['언어치료전공에서 취득가능한 자격증', 41], ['청각학전공에서 취득가능한 자격증', 42], ['보건의료경영학과에서 취득가능한 자격증', 43],\
['유아교육학과에서 취득가능한 자격증', 44], ['뷰티디자인경영학과에서 취득가능한 자격증', 45], ['응급구조학과에서 취득가능한 자격증', 46], ['소방방재전공에서 취득가능한 자격증', 47], ['안전공학전공에서 취득가능한 자격증', 48],\
['간호학과에서 취득가능한 자격증', 49], ['물리치료학과에서 취득가능한 자격증', 50], ['스포츠건강재활학과에서 취득가능한 자격증', 51]]

with cur:
    cur.execute('DROP TABLE IF EXISTS level1')
    cur.execute('DROP TABLE IF EXISTS level2')
    cur.execute('DROP TABLE IF EXISTS level3')
    cur.execute('DROP TABLE IF EXISTS level4')
    cur.execute(sql_create_level1)
    cur.execute(sql_create_level2)
    cur.execute(sql_create_level3)
    cur.execute(sql_create_level4)
    cur.executemany("INSERT INTO level1(question) VALUES(%s)", level1_vals)
    cur.executemany("INSERT INTO level2(question, table1_id) VALUES(%s, %s)", level2_vals)
    cur.executemany("INSERT INTO level3(question, table2_id) VALUES(%s, %s)", level3_vals)
    cur.executemany("INSERT INTO level4(question, table3_id) VALUES(%s, %s)", level4_vals)
    

conn.commit()
conn.close()




'''
테이블 조인

USE chatdb;
SELECT level1.question, level2.question, level3.question, level4.question
FROM level1
LEFT JOIN level2
ON level1.id = level2.table1_id
LEFT JOIN level3
ON level2.id = level3.table2_id
LEFT JOIN level4
ON level3.id = level4.table3_id
'''