import pymysql
conn = pymysql.connect(host='127.0.0.1', user='root', password='qlalfqjsgh1!',db='chatdb',charset='utf8')
cur = conn.cursor()

sql_create_level1 = '''
    CREATE TABLE level1 (
        id INT UNSIGNED NOT NULL AUTO_INCREMENT,
        question VARCHAR(20) NOT NULL,
        PRIMARY KEY(id)
    )
'''
sql_create_level2 = '''
    CREATE TABLE level2 (
        id INT UNSIGNED NOT NULL AUTO_INCREMENT,
        question VARCHAR(20) NOT NULL,
        table1_id INT UNSIGNED NOT NULL,
        PRIMARY KEY(id)
    )
'''

sql_create_level3 = '''
    CREATE TABLE level3 (
        id INT UNSIGNED NOT NULL AUTO_INCREMENT,
        question VARCHAR(256) NOT NULL,
        table2_id INT UNSIGNED NOT NULL,
        PRIMARY KEY(id)
    )
'''

sql_create_level4 = '''
    CREATE TABLE level4 (
        id INT UNSIGNED NOT NULL AUTO_INCREMENT,
        question VARCHAR(256) NOT NULL,
        table3_id INT UNSIGNED NOT NULL,
        PRIMARY KEY(id)
    )
'''

level1_vals = [['학교'], ['시설']]
level2_vals = [['학과', 1], ['학사', 1], ['건물 위치', 2], ['대중교통', 2], ['주요 시설', 2]]
# 22.11.14 조영수 데이터 입력
# 22.11.15 김경호 데이터 추가, 보완
# 혹시 누락된거 있는지 확인하고 있으면 채워넣기
level3_vals = [['휴학',2], ['전과',2], ['재입학',2], ['자퇴/제적',2], ['졸업',2], ['복합터미널',4], ['대전역', 4], ['우송 도서관',5],\
['우송 유치원',5], ['사회 봉사단',5], ['평생교육원',5], ['우송비즈니스 교육센터',5], ['우송IT교육센터',5], ['외국어교육원',5], ['우송디젤철도 아카데미',5], ['공자아카데미',5], ['한국어교육원',5],\
['우송예술회관',5], ['우송수련원',5], ['우송스포츠센터',5], ['F스포렉스',5], ['대전화병원',5],\
['컴퓨터정보보안',1], ['AI빅데이터',1], ['글로벌호텔매니지먼트',1], ['글로벌융합비즈니스',1], ['경영학',1], ['Endicott자유',1], ['자기설계',1], ['글로벌철도',1], ['철도건설시스템',1], ['철도경영',1], ['물류시스템',1], ['철도전기시스템',1], ['철도소프트웨어',1],\
['철도차량시스템',1], ['건축',1], ['우송디젯철도아카데미',1], ['IT보안',1], ['글로벌미디어영상',1], ['게임멀티미디어',1], ['미디어디자인영상',1], ['글로벌조리',1], ['폴보퀴즈조리',1], ['글로벌외식창업',1], ['외식조리',1], ['한식조리과학',1], ['외식조리경영',1],\
['식품영양학',1], ['바이오식품과학',1], ['호텔관광경영',1], ['사회복지학과',1], ['작업치료학과',1], ['언어치료전공',1], ['청각학',1], ['보건의료경영',1], ['유아교육',1], ['뷰티디자인경영',1], ['응급구조',1], ['소방방재',1], ['안전공학',1], ['간호학',1], ['물리치료',1], ['스포츠건강재활',1], ['세무부동산', 1],\
['w1', 3], ['w2', 3], ['w3', 3], ['w4', 3], ['w5', 3], ['w6', 3], ['w7', 3], ['w8', 3], ['w9', 3], ['w10', 3], ['w11', 3], ['w12', 3], ['w13', 3], ['w14', 3], ['w15', 3], ['w16', 3], ['w17', 3], ['w18', 3], ['w19', 3]]

# 22.11.14 강민구 데이터 입력
# 22.11.15 김경호 데이터 추가, 보완
# 22.11.21 조영수 자격증,위치 추가보완
# 학과 진로, 자격증, 위치 한곳에 몰아넣기
# 테이블 보면서 누락된 데이터 있으면 채워 넣고
# 나머지 데이터들도 채워 넣기
level4_vals = [['AI빅데이터학과 졸업 시 소프트웨어 개발자,데이터베이스 관리자로 진로 결정 가능,필요한 자격증:네트워크관리사,정보보안기사(산업기사)', 24],\
['글로벌호텔매니저먼트학과 졸업 시 호텔 총 지배인, 문화유산 해설사로 진로 결정 가능', 25],\
['글로벌융합비즈니스학과 졸업 시 호텔 총 지배인, 문화유산 해설사로 진로 결정 가능,필요한 자격증:변리사,경영지도사', 26],\
['경영학 전공 졸업 시 호텔 총 지배인, 문화유산 해설사로 진로 결정 가능,필요한 자격증:국제무역사,금융투자분석가', 27],\
['세무부동산학 전공 졸업 시 세무사, 부동산 신탁회사로 진로 결정 가능,필요한 자격증:감정펴가사,공인회계사', 65],\
['Endicott자유 전공 입학 시 원하는 학과로 진로 결정 가능.',28],\
['자기 설계 전공 입학 시 원하는 학과로 진로 결정 가능.', 29],\
['글로벌철도학과 졸업 시 철도 공기업, 글로벌 철도 분야로 진로 결정 가능,필요한 자격증:철도건설,철도차량운전면허', 30],\
['철도건설시스템전공 졸업 시 국영기업체, 산업체, 공무원으로 진로 결정 가능,필요한 자격증:건설재료시험기사,콘크리트기사', 31],
['철도경영학과 졸업 시 코레일, 한국 철도 시설 공단으로 진로 결정 가능,필요한 자격증:철도운송산업기사,철도교통안전관리자', 32],\
['물류시스템학과 졸업 시 철도 공사, 도시 철도 공사로  진로 결정 가능,필요한 자격증:유통관리사2급,국제물류관리사', 33],\
['철도전기시스템 전공 졸업 시 국영기업체, 철도 열차 운전 기관사 등 진로 결정 가능,필요한 자격증:전기산업기사,전기공사산업기사', 34],\
['철도소프트웨어 전공 졸업 시 사설 철도 운양 기관, 철도 전기 분야 등 진로 결정 가능,필요한 자격증:전기산업기사,전기공사산업기사', 35],
['철도차량시스템학과 졸업 시 각 도시의 경전철 운영기관, 공무원 및 공기업으로 진로 결정 가능,필요한 자격증:철도차량기사,철도차량운전면허', 36],\
['건축공학과 졸업 시 건설회사, 건축감리전문회사, 건축자제전문회사 등 진로 결정 가능,필요한 자격증:콘크리트산업기사,실내건축기사', 37],\
['우송디젯철도아카데미 졸업 시 철도 관련 회사로 진로 결정 가능,필요한 자격증:운전면허', 38],\
['컴퓨터정보보안 졸업 시 대기업, 우수 정보 보안 기업 등으로 진로 결정 가능,필요한 자격증:정보처리기사,정보관리기사', 23],
['IT보안전공 졸업 시 LG CNS협력업체로 진로 결정 가능,필요한 자격증:정보처리기사,정보관리기사', 39],\
['글로벌미디어영상학과 졸업 시 국내 외 미디어 제작 현장 한류 산업 현장 기자, 저널리스트 등 진로 결정 가능.', 40],\
['게임멀티미디어전공 졸업 시 게임 및 멀티미디어 콘텐츠 업체 등 진로 결정 가능,필요한 자격증:게임기획전문가,게임프로그래밍전문가',41],\
['미디어디자인영상전공 졸업 시 브랜드 디자인 분야, BX(브랜드경형)디자이너 등 진로 결정 가능,필요한 자격증:사진기능사,시각디자인기사', 42],\
['글로벌조리전공 졸업 시 국내 외 호텔 유람선 및 리조트 전문 외식업체 등 진로 결정 가능.', 43],\
['폴보퀴즈조리전공 졸업 시 국내 외 호텔 유람선 및 리조트 전문 외식업체 진로 결정 가능.', 44],\
['글로벌외식창업전공 졸업 시 특급호텔 및 리조트 전문외식 업체, 소믈리에 등 진로 결정 가능.', 45],\
['외식조리전공 졸업 시 호텔, 전문 식당 조리사, 체인형 식당 운영 가능 등 진로 결정 가능,필요한 자격증:조리기능사,조리산업기사', 46],\
['한식조리과학전공 졸업 시 국내외 최고급 한식 레스토랑 조리사, 해외 공관 한식 전문 조리사 등 진로 결정 가능,필요한 자격증:우송대학교 자체 시스템에 의한 한식 자격증 부여,조리기능사', 47],\
['외식조리경영전공 졸업 시 국내 외 호텔 리조트 전문 외식 업체 외식 산업체 운영 진로 결정 가능,필요한 자격증:외식경영관리사,ERP', 48],
['식품영양학전공 졸업 시 초,중,고 영양교사 등 진로 결정 가능,필요한 자격증:영양사,영양교사', 49],\
['바이오식품과학전공 졸업 시 식품 관련 산업체(식품가공개발 및 품질관리사) 진로 결정 가능,필요한 자격증:식품기사,식품가공교사', 50],\
['호텔관광경영학과 졸업 시 호텔관광 산업 분야 호텔, 여행사, 항공사 등으로 진로 결정 가능,필요한 자격증:조주기능사,호텔관리사 자격증', 51],\
['사회복지학과 졸업 시 정부 및 지방자치단체의 사회복지 공무원 등 진로 결정 가능,필요한 자격증:사회복지사 2급이상,보육교사 2급이상', 52],\
['작업치료학과 졸업 시 의료기관, 재활의료관련 분야 등 진로 결정 가능,필요한 자격증:작업치료사 국가 면허증,보조기 및 의지제작 면허증', 53],\
['언어치료전공 졸업 시 의료기관 진로 결정 가능,필요한 자격증:한국언어재활사협회에서 규정하고 있는 이론 및 실습 과목을 이수', 54],\
['청각학전공 졸업 시 의료기관 진로 결정 가능,필요한 자격증:한국청각협회에서 규정하고 있는 이론 및 실습 과목을 이수', 55],\
['보건의료경영학과 졸업 시 의료기관 경영관리 분야,의료 업무, 원무, 인사 등 진로 결정 가능,필요한 자격증:의무기록사,국제의료관광코디네이터', 56],\
['유아교육과 졸업 시 유치원교사, 보육교사 등 진로 결정 가능,필요한 자격증:유치원 2급 정교사,보육교사2급', 57],\
['뷰티디자인경영학과 졸업 시 메이크업 아티스트, 헤어디자이너, 스타일리스트 등 진로 결정 가능,필요한 자격증:미용사 종합면혀증,컬러리스트기사', 58],\
['응급구조학과 졸업 시 자격증 취득 후 119구조구급대, 권역응급의료센텉 등 진로 결정 가능,필요한 자격증:1급 응급구조사,응급처치원', 59],\
['소방방재전공 졸업 시 관련학과 학생만이 응시할 수 있는 8,9급 소방 공무원 특별채용시험 응시 가능,필요한 자격증:소방설비기사,산업안전기사', 60],\
['안전공학전공 졸업 시 관련학과 학생만이 응시할 수 있는 8,9급 소방 공무원 특별채용시험 응시 가능,필요한 자격증:소방설비기사,산업안전기사', 61],\
['간호학과 졸업 시 국내 외 병원 간호사, 국제의료관광코디네이터로 진로 결정 가능,필요한 자격증:국내간호사면허증,보건교육사자격증', 62],\
['물리치료학과 졸업 시 국내 종합 병원, 대학병원, 요양병원재활전문센터로 진로 결정 가능,필요한 자격증:물리치료사면허증',63],\
['스포츠건강재활학과 졸업 시 국내 외 프로구단, 선수촌,대학운동팀 트레이너로 진로 결정 가능,필요한 자격증:전문스포츠지도사,건강운동관리사',64],\
['www.wsu.ac.kr/page/index.jsp?code=campus0103a', 1],\
['www.wsu.ac.kr/page/index.jsp?code=campus0103c',2],\
['www.wsu.ac.kr/page/index.jsp?code=campus0103d',3],\
['www.wsu.ac.kr/page/index.jsp?code=campus0103e',4],\
['www.wsu.ac.kr/page/index.jsp?code=campus0102f',5],\
#위치
['우송도서관 위치:대전광역시 동구 동대전로 171(자양동 155-3번지)',8],\
['우송유치원 위치:대전광역시 동구 동대전로 171(자양동 155-3)우송유치원',9],\
['사회 봉사단 위치:대전광역시 동구 동대전로 171 학생회관 (W16)3층', 10],\
['평생교육원 위치:대전광역시 동구 동대전로 171', 11],\
['우송비즈니스 교육센터 위치:대전광역시 동구 자양동 17-2번지', 12],\
['우송IT교육센터 위치: 대전광역시 동구 백룡로 11번길 63 (자양동 52-2) 우송IT교육센터',13],\
['우송비즈니스교육센터 위치: 대전광역시 동구 백룡로 11번길 63 (자양동 52-2) 우송IT교육센터', 12],\
['외국어교육원 위치: 대전광역시 동구 자양동 196-5번지', 14],\
['우송디젤철도 아카데미 위치: 대전광역시 동구 동대전로 171(자양동226-2)', 15],\
['공자아카데미 위치: 대전광역시 동구 자양동 백룡로 5번길 66-1 우송어학센터 S1 공자아카데미 403호', 16],
['한국어교육원 위치: 대전광역시 동구 동대전로 171(자양동)', 17],\
['우송대학교 서캠퍼스 도서관위치: 704호 우송한국어교육원', 8],\
['우송예술회관 위치: 서캠퍼스 W18 우송예술회관', 18],\
['우송수련원 위치: 충청남도 보령시 신흑동 1944번지', 19],\
['우송스포츠센터 위치: 서캠퍼스 보건의료과학관(W5)', 20],\
['F스포렉스 위치: 대전광역시 동구 삼성1동 151-13', 21],\
['솔브릿지국제대학 내 지하,대전화병원 위치: 대전광역시 동구 신안동 293-1(구 대전동중학교)', 22],\
['AI빅데이터학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 엔디컷빌딩(W19)', 24],\
['글로벌호텔매니지먼트학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 엔디컷빌딩(W19)', 25],\
['글로벌융합비즈니스학과 위치: 대전광역시 동구 동대전로 171우송대 서캠퍼스 엔디컷빌딩(W19)', 26],\
['경영학전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 우송관(W7)',27],\
['세무부동산학전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 우송관(W7)', 65],\
['Endicott자유전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 엔디컷빌딩(W19)', 28],\
['자기설계전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 엔디컷빌딩(W19)', 29],\
['글로벌철도학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 엔디컷빌딩(W19)', 30],\
['철도건설시스템전공 위치:대전광역시 동구 동대전로 171 우송대 서캠퍼스 철도물류관(W4)', 31],\
['철도경영학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 보건의료과학관(W5)',32],\
['물류시스템학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 철도물류관(W4)',33],\
['철도전기시스템전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 철도물류관(W4)',34],\
['철도소프트웨어전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 철도물류관(W4)',35],\
['철도차량시스템학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 철도물류관(W4)',36],\
['건축공학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 국제교육센터(W2)',37],\
['우송디젯철도아카데미 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 철도물류관(W4)',38],\
['컴퓨터정보보안전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 식품건축관(구 사회관)(W15)',23],\
['IT보안전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 식품건축관(구 사회관)(W15)',39],\
['글로벌미디어영상학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 엔디컷빌딩(W19)',40],\
['게임멀티미디어전공 위치:대전광역시 동구 동대전로 171 우송대 서캠퍼스 미디어융합관(W17)',41],\
['미디어디자인영상전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 미디어융합관(W17)',42],\
['글로벌조리전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 SICA',43],\
['폴보퀴즈조리전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 SICA',44],\
['글로벌외식창업전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 엔디컷빌딩(W19)',45],\
['외식조리전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 우송타워(W13)',46],\
['한식조리과학전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 우송타워(W13)',47],\
['외식조리경영전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 우송타워(W13)',48],\
['식품영양학 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 우송타워(W13)',49],\
['호텔관광경영학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 우송타워(W13)',51],\
['사회복지학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 사회복지관(W10)',52],\
['작업치료학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 보건의료과학관(W5)',53],\
['언어치료전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 보건의료과학관(W5)',54],\
['보건의료경영학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 보건의료과학관(W5)',56],\
['유아교육과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 정례원(W9)',57],\
['뷰티디자인경영학과 위치: 대전광역시 동구 동대전로 143 우송뷰티센터(S3)',58],\
['응급구조학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 보건의료과학관(W5)',59],\
['소방방재전공 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 철도물류관(W4)',60],\
['간호학과 위치: 대전광역시 동구 동대전로 171 우송대 서캠퍼스 보건의료과학관(W5)',62],\
['물리치료학과 위치: 대전광역시 동구 동대전로 171 서캠퍼스 보건의료과학관(W5)',63],\
['스포츠건강재활학과 위치:대전광역시 동구 동대전로 171 우송대 서캠퍼스 보건의료과학관(W5)',64],\
['W1위치:https://naver.me/xmPqtfQU',66],\
['W2위치:https://naver.me/GqsJNB13',67],\
['W3위치:https://naver.me/FgvwSvJM',68],\
['W4위치:https://naver.me/GlmXYm3W',69],\
['W5위치:https://naver.me/52h9TTCb',70],\
['W6위치:https://naver.me/xcJW99WA',71],\
['W7위치:https://naver.me/GnCUvv9Q',72],\
['W8위치:https://naver.me/xmPqttoU',73],\
['W9위치:https://naver.me/5P2JssXl',74],\
['W10위치:https://naver.me/IFFSIaVj',75],\
['W11위치:https://naver.me/G4L0xWwj',76],\
['W12위치:https://naver.me/xzLFnxMe',77],\
['W13위치:https://naver.me/xOmPIxqn',78],\
['W14위치:https://naver.me/5yqXBPJy',79],\
['W15위치:https://naver.me/5D3qj8YT',80],\
['W16위치:https://naver.me/Ge5FdULk',81],\
['W17위치:https://naver.me/F0w0tAl4',82],\
['W18위치:https://naver.me/xzLFnHm4',83],\
['W19위치:https://naver.me/xM87NTe0',84],\
['대전역: 도보 5분 후 대전역/중앙시장에서 605번 버스 탑승, 자양동주민센터에서 하차 후 도보 5분',7],\
['복합터미널: 도보 4분 후 복합터미널에서 102번 버스 탑승, 우송대학교서캠퍼스에서 하차 후 도보 8분',6]]

with cur:
    cur.execute('DROP TABLE IF EXISTS level1')
    cur.execute('DROP TABLE IF EXISTS level2')
    cur.execute('DROP TABLE IF EXISTS level3')
    cur.execute('DROP TABLE IF EXISTS level4')
    cur.execute(sql_create_level1)
    cur.execute(sql_create_level2)
    cur.execute(sql_create_level3)
    cur.execute(sql_create_level4)
    cur.executemany("INSERT INTO level1(question) VALUES(%s)", level1_vals)
    cur.executemany("INSERT INTO level2(question, table1_id) VALUES(%s, %s)", level2_vals)
    cur.executemany("INSERT INTO level3(question, table2_id) VALUES(%s, %s)", level3_vals)
    cur.executemany("INSERT INTO level4(question, table3_id) VALUES(%s, %s)", level4_vals)

conn.commit()
conn.close()