# 22.11.14 강민구
import pymysql

conn=pymysql.connect(host='127.0.0.1',user='root',
password='rkdalsrn2145',db='chatdb',charset='utf8') #ㅇㄷ 비번

cur=conn.cursor()
sql_create_level1='''
    CREATE TABLE level1(
        id INT UNSIGNED NOT NULL AUTO_INCREMENT,
        question VARCHAR(20) NOT NULL,
        PRIMARY KEY(id)
    )
    '''
sql_create_level2='''
    CREATE TABLE level2(
        id INT UNSIGNED NOT NULL AUTO_INCREMENT,
        question VARCHAR(20) NOT NULL,
        table1_id int,
        PRIMARY KEY(id)
        )'''
sql_create_level3='''
    CREATE TABLE level3(
        id INT UNSIGNED NOT NULL AUTO_INCREMENT,
        question VARCHAR(20) NOT NULL,
        table2_id int,
        PRIMARY KEY(id)
        )'''
sql_create_level4='''
    CREATE TABLE level4(
        id INT UNSIGNED NOT NULL AUTO_INCREMENT,
        question VARCHAR(20) NOT NULL,
        table3_id int,
        PRIMARY KEY(id)
        )'''

level1_vals=[['학교'],['시설']]
level2_vals=[['학과',1],['학사',1],['건물위치',2],['오시는길',2],['주요 시설',2]]
level3_vals=[['ㅅㅁㅌ',1],['ㅋㅈ',1],['ㄱㅁ',1],['졸업',2],['입학',2]]
level4_vals=[['AI빅데이터학과 졸업 시 소프트웨어 개발자, 데이터베이스 관리자로 진로 결정 가능.',1],\
    ['글로벌호텔매니저먼트학과 졸업 시 호텔 총 지배인, 문화유산 해설사로 진로 결정 가능.',1],\
    ['글로벌융합비즈니스학과 졸업 시 호텔 총 지배인, 문화유산 해설사로 진로 결정 가능.',1],\
    ['경영학 전공 졸업 시 호텔 총 지배인, 문화유산 해설사로 진로 결정 가능.',1],\
    ['세무부동산학 전공 졸업 시 세무사, 부동산 신탁회사로 진로 결정 가능.',1],\
    ['Endicott자유 전공 입힉 시 원하는 학과로 진로 결정 가능.',1],\
    ['자기 설계 전공 입학 시 원하는 학과로 진로 결정 가능.'],\
    ['굴로벌철도학과 졸업 시 철도 공기업, 글로벌 철도 분야로 진로 결정 가능.'],\
    ['철도건설시스템전공 졸업 시 국영기업체, 산업체, 공무원으로 진로 결정 가능.'],\
    ['철도경영학과 졸업 시 코레일, 한국 철도 시설 공단으로 진로 결정 가능.'],\
    ['물류시스템학과 졸업 시 철도 공사, 도시 철도 공사로  진로 결정 가능.'],\
    ['철도전기시스템 전공 졸업 시 국영기업체, 철도 열차 운전 기관사 등 진로 결정 가능.'],\
    ['철도소프트웨어 전공 졸업 시 사설 철도 운양 기관, 철도 전기 분야 등 진로 결정 가능.'],\
    ['철도차량시스템학과 졸업 시 각 도시의 경전철 운영기관, 공무원 및 공기업으로 진로 결정 가능.'],\
    ['건축공학과 졸업 시 건설회사, 건축감리전문회사, 건축자제전문회사 등 진로 결정 가능.'],\
    ['우송디젯철도아카데미 졸업 시 철도 관련 회사로 진로 결정 가능.'],\
    ['컴퓨터정보보안 졸업 시 대기업, 우수 정보 보안 기업 등으로 진로 결정 가능.'],\
    ['IT보안전공 졸업 시 LG CNS협력업체로 진로 결정 가능.'],\
    ['글로벌미디어영상학과 졸업 시 국내 외 미디어 제작 현장 한류 산업 현장 기자, 저널리스트 등 진로 결정 가능.'],\
    ['게임멀티미디어전공 졸업 시 게임 및 멀티미디어 콘텐츠 업체 등 진로 결정 가능.'],\
    ['미디어디자인영상전공 졸업 시 브랜드 디자인 분야, BX(브랜드경형)디자이너 등 진로 결정 가능.'],\
    ['글로벌조리전공 졸업 시 국내 외 호텔 유람선 및 리조트 전문 외식업체 등 진로 결정 가능.'],\
    ['폴보퀴즈조리전공 졸업 시 국내 외 호텔 유람선 및 리조트 전문 외식업체 진로 결정 가능.'],\
    ['글로벌외식창업전공 졸업 시 특급호텔 및 리조트 전문외식 업체, 소믈리에 등 진로 결정 가능.'],\
    ['외식조리전공 졸업 시 호텔, 전문 식당 조리사, 체인형 식당 운영 가능 등 진로 결정 가능.'],\
    ['한식조리과학전공 졸업 시 국내외 최고급 한식 레스토랑 조리사, 해외 공관 한식 전문 조리사 등 진로 결정 가능.'],\
    ['외식조리경영전공 졸업 시 국내 외 호텔 리조트 전문 외식 업체 외식 산업체 운영 진로 결정 가능.'],\
    ['식품영양학전공 졸업 시 초,중,고 영양교사 등 진로 결정 가능.'],\
    ['바이오식품과학전공 졸업 시 식품 관련 산업체(식품가공개발 및 품질관리사) 진로 결정 가능. '],\
    ['호텔관광경영학과 졸업 시 호텔관광 산업 분야 호텔, 여행사, 항공사 등으로 진로 결정 가능.'],\
    ['사회복지학과 졸업 시 정부 및 지방자치단체의 사회복지 공무원 등 진로 결정 가능.'],\
    ['작업치료학과 졸업 시 의료기관, 재활의료관련 분야 등 진로 결정 가능.'],\
    ['언어치료전공 졸업 시 의료기관 진로 결정 가능.'],\
    ['언어치료전공 졸업 시 의료기관 진로 결정 가능.'],\
    ['청각학전공 졸업 시 의료기관 진로 결정 가능.'],\
    ['보건의료경영학과 졸업 시 의료기관 경영관리 분야,의료 업무, 원무, 인사 등 진로 결정 가능.'],\
    ['유아교육과 졸업 시 유치원교사, 보육교사 등 진로 결정 가능.'],\
    ['뷰티디자인경영학과 졸업 시 메이크업 아티스트, 헤어디자이너, 스타일리스트 등 진로 결정 가능.'],\
    ['응급구조학과 졸업 시 자격증 취득 후 119구조구급대, 권역응급의료센텉 등 진로 결정 가능.'],\
    ['소방방재전공 졸업 시 관련학과 학생만이 응시할 수 있는 8,9급 소방 공무원 특별채용시험 응시 가능.'],\
    ['안전공학전공 졸업 시 관련학과 학생만이 응시할 수 있는 8,9급 소방 공무원 특별채용시험 응시 가능.'],\
    ['간호학과 졸업 시 국내 외 병원 간호사, 국제의료관광코디네이터로 진로 결정 가능.'],\
    ['물리치료학과 졸업 시 국내 종합 병원, 대학병원, 요양병원재활전문센터로 진로 결정 가능.'],\
    ['스포츠건강재활학과 졸업 시 국내 외 프로구단, 선수촌,대학운동팀 트레이너로 진로 결정 가능.'],\
    
    #학과 설명
    [' AI빅데이터학과에 필요한 자격증'],\
    ['글로벌호텔매니지먼트학과에 필요한 자격증'],\
    ['글로벌융합비즈니스학과에 필요한 자격증'],\
    ['경영학전공에 필요한 자격증'],\
    ['세무부동산학전공에 필요한 자격증'],\
    ['Endicott자유전공에 필요한 자격증'],\
    ['자기설계전공에 필요한 자격증'],\     
    ['글로벌철도학과에 필요한 자격증'],\
    ['철도건설시스템전공에 필요한 자격증'],\    
    ['철도경영학과에 필요한 자격증'],\
    ['물류시스템학과에 필요한 자격증'],\
    ['철도전기시스템전공에 필요한 자격증'],\
    ['철도소프트웨어전공에 필요한 자격증'],\
    ['철도차량시스템학과에 필요한 자격증'],\
    ['건축공학과에 필요한 자격증'],\
    ['우송디젯철도아카데미에 필요한 자격증'],\
    ['컴퓨터정보보안에 필요한 자격증'],\
    ['IT보안전공에 필요한 자격증'],\
    ['글로벌미디어영상학과에 필요한 자격증'],\
    ['게임멀티미디어전공에 필요한 자격증'],\
    ['미디어디자인영상전공에 필요한 자격증'],\
    ['글로벌조리전공에 필요한 자격증'],\
    ['폴보퀴즈조리전공에 필요한 자격증'],\
    ['글로벌외식창업전공에 필요한 자격증'],\
    ['외식조리전공에 필요한 자격증'],\
    ['한식조리과학전공에 필요한 자격증'],\
    ['외식조리경영전공에 필요한 자격증'],\
    ['식품영양학전공에 필요한 자격증'],\
    ['바이오식품과학전공에 필요한 자격증'],\
    ['호텔관광경영학과에 필요한 자격증'],\
    ['사회복지학과에 필요한 자격증'],\
    ['작업치료학과에 필요한 자격증'],\
    ['언어치료전공에 필요한 자격증'],\
    ['청각학전공에 필요한 자격증'],\
    ['보건의료경영학과에 필요한 자격증'],\    
    ['유아교육학과에 필요한 자격증'],\
    ['뷰티디자인경영학과에 필요한 자격증'],\
    ['응급구조학과에 필요한 자격증'],\
    ['소방방재전공에 필요한 자격증'],\
    ['안전공학전공에 필요한 자격증'],\ 
    ['간호학과에 필요한 자격증'],\
    ['물리치료학과에 필요한 자격증'],\
    ['스포츠건강재활학과에 필요한 자격증']]
    


with cur:
    cur.execute('DROP TABLE IF EXISTS level1')
    cur.execute('DROP TABLE IF EXISTS level2')
    cur.execute('DROP TABLE IF EXISTS level3')
    cur.execute('DROP TABLE IF EXISTS level4')
    cur.execute(sql_create_level1)
    cur.execute(sql_create_level2)
    cur.execute(sql_create_level3)
    cur.execute(sql_create_level4)
    cur.executemany("INSERT INTO level1(question) VALUES(%s)", level1_vals)
    cur.executemany("INSERT INTO level2(question, table1_id) VALUES(%s, %s)", level2_vals)
    cur.executemany("INSERT INTO level3(question, table2_id) VALUES(%s, %s)", level3_vals)
    cur.executemany("INSERT INTO level4(question, table3_id) VALUES(%s, %s)", level4_vals)



conn.commit()
conn.close()